import os

import pyarabic.araby as araby


RANDOM_SEED = 42

CPU_COUNT = os.cpu_count()

ARABIC_LETTERS = "".join(araby.LETTERS) + "".join(araby.LIGUATURES)


ALEF_RASM = "ا"
BAA_RASM = "\u066e"
JEEM_RASM = "ح"
DAL_RASM = "د"
RAA_RASM = "ر"
SEEN_RASM = "س"
SAAD_RASM = "ص"
TAA_RASM = "ط"
AIN_RASM = "ع"
FAA_RASM = "\u06a1"
QAF_RASM = "\u066f"
KAF_RASM = "ك"
LAM_RASM = "ل"
MEEM_RASM = "م"
# NOON_RASM =u'\u06BA' same as baa_shape?
NOON_RASM = "\u06ba"
HAA_RASM = "ه"
WAW_RASM = "و"
YAA_RASM = "ى"
HAMZA_RASM = "ء"

LETTERS_MAPPING = {
    "ا": ALEF_RASM,
    "أ": ALEF_RASM,
    "إ": ALEF_RASM,
    "آ": ALEF_RASM,
    "ب": BAA_RASM,
    "ت": BAA_RASM,
    "ث": BAA_RASM,
    "ج": JEEM_RASM,
    "ح": JEEM_RASM,
    "خ": JEEM_RASM,
    "د": DAL_RASM,
    "ذ": DAL_RASM,
    "ر": RAA_RASM,
    "ز": RAA_RASM,
    "س": SEEN_RASM,
    "ش": SEEN_RASM,
    "ص": SAAD_RASM,
    "ض": SAAD_RASM,
    "ط": TAA_RASM,
    "ظ": TAA_RASM,
    "ع": AIN_RASM,
    "غ": AIN_RASM,
    "ف": FAA_RASM,
    "ق": FAA_RASM,
    "ك": KAF_RASM,
    "ل": LAM_RASM,
    "م": MEEM_RASM,
    "ن": BAA_RASM,
    "ه": HAA_RASM,
    "ة": HAA_RASM,
    "و": WAW_RASM,
    "ؤ": WAW_RASM,
    "ي": YAA_RASM,
    "ى": YAA_RASM,
    "ئ": YAA_RASM,
    "ء": HAMZA_RASM,
}


NEW_LINE = "\n"


UNICODE_LETTERS_MAPPING = {
    "ﻲ": "ي",
    "ﻟ": "ل",
    "ﻓ": "و",
    "ﺎ": "ا",
    "ﺍ": "ا",
    "ﻭ": "و",
    "ﺮ": "ر",
    "ﻣ": "م",
    "ک": "ك",
    "ﻴ": "ي",
    "ﻮ": "و",
    "ﻳ": "ي",
    "ﺪ": "د",
    "ﻻ": "لا",
    "ﻠ": "ل",
    "ﺑ": "ب",
    "ﺭ": "ر",
    "ﻤ": "م",
    "ﻬ": "ه",
    "ﻨ": "ن",
    "ﻋ": "ء",
    "ﻰ": "ى",
    "ﺗ": "ت",
    "ﻧ": "ن",
    "ﻢ": "م",
    "ﻪ": "ه",
    "ﺃ": "أ",
    "ﺘ": "ت",
    "ﻌ": "ع",
    "ﻦ": "ن",
    "ﺒ": "ب",
    "ﺣ": "ح",
    "ﺇ": "إ",
    "ﺴ": "س",
    "گ": "ك",
    "ﻗ": "و",
    "ﺤ": "ح",
    "ﺳ": "س",
    "ﺩ": "د",
    "ٱ": "ا",
    "ﺖ": "ت",
    "ﻔ": "ف",
    "ﻷ": "لأ",
    "ﻘ": "ق",
    "ﺟ": "ج",
    "ﻞ": "ل",
    "ﻛ": "ك",
    "ﻫ": "ه",
    "ﻜ": "ك",
    "ﻥ": "ن",
    "ﺠ": "ج",
    "ﺸ": "ش",
    "ﺼ": "ص",
    "ﻚ": "ك",
    "ﻝ": "ل",
    "ﺀ": "ء",
    "ﻡ": "م",
    "|": "ا",
    "ﺔ": "ة",
    "ﺛ": "ث",
    "ﺷ": "ش",
    "ﺰ": "ز",
    "ﺬ": "ذ",
    "ﺧ": "خ",
    "ﺐ": "ب",
    "ﺻ": "ص",
    "ﻱ": "ي",
    "ﻩ": "ه",
    "ﻄ": "ط",
    "ﻼ": "لا",
    "ﺫ": "ذ",
    "ﺕ": "ت",
    "ﺏ": "ب",
    "ی": "ى",
    "ﻯ": "ى",
    "ﻏ": "غ",
    "ﺨ": "خ",
    "ﻊ": "ع",
    "ﺓ": "ة",
    "ﻀ": "ض",
    "ﺂ": "آ",
    "ﻙ": "ك",
    "ﻐ": "غ",
    "ﻕ": "ق",
    "ﻃ": "ط",
    "ﻒ": "ف",
    "ﺯ": "ز",
    "ﻑ": "ف",
    "ھ": "ه",
    "ﻖ": "ق",
    "ٲ": "ا",
    "ﺿ": "ض",
    "ﺄ": "أ",
    "ﺜ": "ث",
    "ﺡ": "ح",
    "ﻉ": "ع",
    "ﺢ": "ح",
    "ﺱ": "س",
    "ﺋ": "ئ",
    "ﻈ": "ظ",
    "ﭐ": "ا",
    "ﻵ": "لآ",
    "ﻹ": "لإ",
    "ﺲ": "س",
    "ﺌ": "ئ",
    "ﺝ": "ج",
    "ﻂ": "ط",
    "ﻇ": "ظ",
    "ﺶ": "ش",
    "ﺽ": "ض",
    "ﭑ": "ا",
    "ﺾ": "ض",
    "ﺞ": "ج",
    "ﺅ": "ؤ",
    "ﺚ": "ث",
    "ﺺ": "ص",
    "ﻸ": "ﻷ",
    "ﺈ": "إ",
    "ﺆ": "ؤ",
    "ﻶ": "لآ",
    "ﯾ": "ي",
    "ﻎ": "غ",
    "ﺦ": "خ",
    "ﻍ": "غ",
    "ﺥ": "خ",
    "ﺵ": "ش",
    "ﻺ": "لإ",
    "ٳ": "ا",
    "ﻅ": "ظ",
    "ﺙ": "ث",
    "ﺉ": "ئ",
    "\xa0": "",
}

ARABIC_LETTERS_WITHOUT_DOTS = {
    "ك",
    "ل",
    "م",
    "ء",
}
